                            
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если МобильныйКлиент или МобильноеПриложение Тогда			
		Элементы.Поиск.Видимость = Истина;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Жанры(Команда)
	ОткрытьФорму("Справочник.Жанры.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Страны(Команда)
	ОткрытьФорму("Справочник.Страны.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтиль(Команда)
	ОткрытьФорму("ОбщаяФорма.СменитьСтиль");
КонецПроцедуры

&НаКлиенте
Процедура Пользователи(Команда)
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.Настройки");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = Пользователи.ТекущийПользователь();
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("СкрытьПросмотренные", СкрытьПросмотренные);
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПросмотренныеПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры
